# 아래 예제와 같이 고양이를 출력하시오.

# \    /\
#  )  ( ')
# (  /  )
#  \(__)|

# print("\\\t\b\b\b/\\\n )  ( ')\n(  /  )\n \\(__)|")
# \t는 빈칸 8개를 차지한다.

print("\\    /\\")
print(" )  ( ')")
print("(  /  )")
print(" \(__)|")

# 아래 예제와 같이 개를 출력하시오.

# |\_/|
# |q p|   /}
# ( 0 )"""\
# |"^"`    |
# ||_/=\\__|

print("|\\_/|")
print("|q p|   /}")
print("( 0 )\"\"\"\\")
print("|\"^\"`    |")
print("||_/=\\\\__|")

# 아래 예제와 같이 새싹을 출력하시오.
# 입력은 없다.
# 새싹을 출력한다.

print("         ,r\'\"7")
print("r`-_   ,\'  ,/")
print(" \\. \". L_r\'")
print("   `~\\/")
print("      |")
print("      |")